<a href="https://colab.research.google.com/github/shreejitp/Python/blob/master/Pysparkdf_vs_Pandasdf.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Often we work with data in Dataframes. They could be in a pandas dataframe or in a pyspark dataframe. I have listed some of the most commonly used operations with examples on dataframes in both pandas and pyspark.  

Warning: A different version of JAVA on the machine you are using may give some errors for pyspark dataframes. Otherwise, the code should work fine.

In [0]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.6/dist-packages (2.4.5)
Requirement already satisfied: py4j==0.10.7 in /usr/local/lib/python3.6/dist-packages (from pyspark) (0.10.7)

In [0]:
from pyspark.sql import SparkSession

spark = SparkSession \
    .builder \
    .appName("Python Spark create RDD example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

In [0]:
df = spark.sparkContext\
          .parallelize([(1, 2, 3, 'a b c'),
              (4, 5, 6, 'd e f'),
              (7, 8, 9, 'g h i')])\
.toDF(['col1', 'col2', 'col3','col4'])

df.show()

+----+----+----+-----+
|col1|col2|col3| col4|
+----+----+----+-----+
|   1|   2|   3|a b c|
|   4|   5|   6|d e f|
|   7|   8|   9|g h i|
+----+----+----+-----+

#**RDD**

RDD represents Resilient Distributed Dataset
An RDD in Spark is simply an immutable distributed collection of objects sets. Each RDD is split into multiple partitions (similar pattern with smaller sets), which may be computed on different nodes of the cluster

1. By using parallelize( ) function

In [0]:
from pyspark.sql import SparkSession
spark = SparkSession \
    .builder \
    .appName("Python Spark create RDD example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()
df = spark.sparkContext.parallelize([(1, 2, 3, 'a b c'),
             (4, 5, 6, 'd e f'),
             (7, 8, 9, 'g h i')]).toDF(['col1', 'col2', 'col3','col4'])

In [0]:
df.show()

+----+----+----+-----+
|col1|col2|col3| col4|
+----+----+----+-----+
|   1|   2|   3|a b c|
|   4|   5|   6|d e f|
|   7|   8|   9|g h i|
+----+----+----+-----+

2. By using createDataFrame( ) function

In [0]:
from pyspark.sql import SparkSession
spark = SparkSession \
    .builder \
    .appName("Python Spark create RDD example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

Employee = spark.createDataFrame([
                        ('1', 'Joe',   '70000', '1'),
                        ('2', 'Henry', '80000', '2'),
                        ('3', 'Sam',   '60000', '2'),
                        ('4', 'Max',   '90000', '1')],
                        ['Id', 'Name', 'Sallary','DepartmentId']
)

In [0]:
Employee.show()

+---+-----+-------+------------+
| Id| Name|Sallary|DepartmentId|
+---+-----+-------+------------+
|  1|  Joe|  70000|           1|
|  2|Henry|  80000|           2|
|  3|  Sam|  60000|           2|
|  4|  Max|  90000|           1|
+---+-----+-------+------------+

3. By using read and load functions

In [0]:
## set up  SparkSession
## Path here is the colab 
from pyspark.sql import SparkSession
spark = SparkSession \
    .builder \
    .appName("Python Spark create RDD example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()
df = spark.read.format('com.databricks.spark.csv').\
                               options(header='true', \
                                       inferschema='true').\
load("/content/weather-stations.csv",header=True)
#df.show(5)
df.printSchema()

+--------------------+------+--------+----+----+----+---+----+----+----+----+----+----+---+-----+----+---+----+----+----+----+---+-----+----+-------+
|            Stn_Name|   Lat|    Long|Prov|  Tm|DwTm|  D|  Tx|DwTx|  Tn|DwTn|   S| DwS|S%N|    P| DwP|P%N| S_G|  Pd|  BS|DwBS|BS%|  HDD| CDD| Stn_No|
+--------------------+------+--------+----+----+----+---+----+----+----+----+----+----+---+-----+----+---+----+----+----+----+---+-----+----+-------+
|           CHEMAINUS|48.935|-123.742|  BC| 8.2|   0| NA|13.5|   0| 1.0|   0| 0.0|   0| NA|178.8|   0| NA|   0|  12|null|null| NA|273.3|   0|1011500|
|COWICHAN LAKE FOR...|48.824|-124.133|  BC| 7.0|   0|  3|15.0|   0|-3.0|   0| 0.0|   0|  0|258.6|   0|104|   0|  12|null|null| NA|307.0|   0|1012040|
|       LAKE COWICHAN|48.829|-124.052|  BC| 6.8|  13|2.8|16.0|   9|-2.5|   9| 0.0|   9| NA|264.6|   9| NA|null|  11|null|null| NA|168.1|   0|1012055|
|    DISCOVERY ISLAND|48.425|-123.226|  BC|null|null| NA|12.5|   0|null|null|null|null| NA| null|null| NA|null|null|null|null| NA| null|null|1012475|
| DUNCAN KELVIN CREEK|48.735|-123.728|  BC| 7.7|   2|3.4|14.5|   2|-1.0|   2| 0.0|   2| NA|168.4|   2| NA|null|  11|null|null| NA|267.7|   0|1012573|
+--------------------+------+--------+----+----+----+---+----+----+----+----+----+----+---+-----+----+---+----+----+----+----+---+-----+----+-------+
only showing top 5 rows

root
 |-- Stn_Name: string (nullable = true)
 |-- Lat: double (nullable = true)
 |-- Long: double (nullable = true)
 |-- Prov: string (nullable = true)
 |-- Tm: double (nullable = true)
 |-- DwTm: integer (nullable = true)
 |-- D: string (nullable = true)
 |-- Tx: double (nullable = true)
 |-- DwTx: integer (nullable = true)
 |-- Tn: double (nullable = true)
 |-- DwTn: integer (nullable = true)
 |-- S: double (nullable = true)
 |-- DwS: integer (nullable = true)
 |-- S%N: string (nullable = true)
 |-- P: double (nullable = true)
 |-- DwP: integer (nullable = true)
 |-- P%N: string (nullable = true)
 |-- S_G: integer (nullable = true)
 |-- Pd: integer (nullable = true)
 |-- BS: string (nullable = true)
 |-- DwBS: string (nullable = true)
 |-- BS%: string (nullable = true)
 |-- HDD: double (nullable = true)
 |-- CDD: integer (nullable = true)
 |-- Stn_No: string (nullable = true)

In [0]:
import pandas as pd 
dp = pd.read_csv('/content/weather-stations.csv')

#**First n Rows**

In [0]:
dp.head(1)

    Stn_Name     Lat     Long Prov   Tm  ...  DwBS  BS%    HDD  CDD   Stn_No
0  CHEMAINUS  48.935 -123.742   BC  8.2  ...   NaN  NaN  273.3  0.0  1011500

[1 rows x 25 columns]

In [0]:
df.show(1)

+---------+------+--------+----+---+----+---+----+----+---+----+---+---+---+-----+---+---+---+---+----+----+---+-----+---+-------+
| Stn_Name|   Lat|    Long|Prov| Tm|DwTm|  D|  Tx|DwTx| Tn|DwTn|  S|DwS|S%N|    P|DwP|P%N|S_G| Pd|  BS|DwBS|BS%|  HDD|CDD| Stn_No|
+---------+------+--------+----+---+----+---+----+----+---+----+---+---+---+-----+---+---+---+---+----+----+---+-----+---+-------+
|CHEMAINUS|48.935|-123.742|  BC|8.2|   0| NA|13.5|   0|1.0|   0|0.0|  0| NA|178.8|  0| NA|  0| 12|null|null| NA|273.3|  0|1011500|
+---------+------+--------+----+---+----+---+----+----+---+----+---+---+---+-----+---+---+---+---+----+----+---+-----+---+-------+
only showing top 1 row

#**Column Names**

In [0]:
#Column Names of Pyspark DF 
# dp.columns
df.columns

['Stn_Name',
 'Lat',
 'Long',
 'Prov',
 'Tm',
 'DwTm',
 'D',
 'Tx',
 'DwTx',
 'Tn',
 'DwTn',
 'S',
 'DwS',
 'S%N',
 'P',
 'DwP',
 'P%N',
 'S_G',
 'Pd',
 'BS',
 'DwBS',
 'BS%',
 'HDD',
 'CDD',
 'Stn_No']

# **Data Types**

In [0]:
#DataTypes 
# dp.types
df.dtypes

[('Stn_Name', 'string'),
 ('Lat', 'double'),
 ('Long', 'double'),
 ('Prov', 'string'),
 ('Tm', 'double'),
 ('DwTm', 'int'),
 ('D', 'string'),
 ('Tx', 'double'),
 ('DwTx', 'int'),
 ('Tn', 'double'),
 ('DwTn', 'int'),
 ('S', 'double'),
 ('DwS', 'int'),
 ('S%N', 'string'),
 ('P', 'double'),
 ('DwP', 'int'),
 ('P%N', 'string'),
 ('S_G', 'int'),
 ('Pd', 'int'),
 ('BS', 'string'),
 ('DwBS', 'string'),
 ('BS%', 'string'),
 ('HDD', 'double'),
 ('CDD', 'int'),
 ('Stn_No', 'string')]

# **Fill Null**

In [0]:
import pandas as pd
my_list = [['male', 1, None], ['female', 2, 3],['male', 3, 4]] 
dp = pd.DataFrame(my_list,columns=['A', 'B', 'C'])
ds = spark.createDataFrame(my_list, ['A', 'B', 'C'])
#
ds.show()

+------+---+----+
|     A|  B|   C|
+------+---+----+
|  male|  1|null|
|female|  2|   3|
|  male|  3|   4|
+------+---+----+

In [0]:
dp.head()

        A  B    C
0    male  1  NaN
1  female  2  3.0
2    male  3  4.0

In [0]:
dp.fillna(-99)

        A  B     C
0    male  1 -99.0
1  female  2   3.0
2    male  3   4.0

In [0]:
ds.fillna(-99).show()

+------+---+---+
|     A|  B|  C|
+------+---+---+
|  male|  1|-99|
|female|  2|  3|
|  male|  3|  4|
+------+---+---+

# **Replace Values**

In [0]:
#Replacing male by 1 and female by 0 
dp.A.replace(['male', 'female'],[1, 0], inplace=True) 
dp

   A  B    C
0  1  1  NaN
1  0  2  3.0
2  1  3  4.0

In [0]:
ds.na.replace(['male','female'],['1','0']).show()

+---+---+----+
|  A|  B|   C|
+---+---+----+
|  1|  1|null|
|  0|  2|   3|
|  1|  3|   4|
+---+---+----+

# **Rename Columns**

In [0]:
dp.columns = ['a','b','c'] 
dp.head(4)

   a  b    c
0  1  1  NaN
1  0  2  3.0
2  1  3  4.0

In [0]:
ds.toDF('a','b','c').show(4)

+------+---+----+
|     a|  b|   c|
+------+---+----+
|  male|  1|null|
|female|  2|   3|
|  male|  3|   4|
+------+---+----+

Rename one or more columns

In [0]:
mapping = {'c':'Newspaper','b':'Sales'}

In [0]:
dp.rename(columns=mapping).head(4)

   a  Sales  Newspaper
0  1      1        NaN
1  0      2        3.0
2  1      3        4.0

In [0]:
#Renaming Column B and C to Sales and Newspaper respectively using a mapping 
mapping = {'C':'Newspaper','B':'Sales'}
new_names = [mapping.get(col,col) for col in ds.columns] 
ds.toDF(*new_names).show(4)

+------+-----+---------+
|     A|Sales|Newspaper|
+------+-----+---------+
|  male|    1|     null|
|female|    2|        3|
|  male|    3|        4|
+------+-----+---------+

You can also use withColumnRenamed to renameonecolumn in PySpark

In [0]:
#Renaming column B to Paper 
ds.withColumnRenamed('B','Paper').show(4)

+------+-----+----+
|     A|Paper|   C|
+------+-----+----+
|  male|    1|null|
|female|    2|   3|
|  male|    3|   4|
+------+-----+----+

# **Drop Columns**

In [0]:
drop_name = ['a','b']
dp.drop(drop_name,axis=1).head(4)

     c
0  NaN
1  3.0
2  4.0

In [0]:
drop_name = ['A','B']
ds.drop(*drop_name).show(4)

+----+
|   C|
+----+
|null|
|   3|
|   4|
+----+

# **Filter**

In [0]:
#Files on Colab in Sample_data 
dp = pd.read_csv('/content/sample_data/california_housing_train.csv')
#
ds = spark.read.csv(path='/content/sample_data/california_housing_train.csv',
                    header=True,
                    inferSchema=True)

In [0]:
dp.head(3)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0

[3 rows x 9 columns]

In [0]:
#Filtering all House Median Age Below 20 
dp[dp.housing_median_age<20].head(4)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0

[4 rows x 9 columns]

In [0]:
#Doing the same on Pyspark Dataframe 
ds[ds.housing_median_age<20].show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|
|  -114.56|   33.69|              17.0|      720.0|         174.0|     333.0|     117.0|       1.6509|           85700.0|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
only showing top 4 rows

In [0]:
#Filtering using conditions on 2 columns 
dp[(dp.housing_median_age<20)&(dp.total_rooms>1000)].head(4)

    longitude  latitude  ...  median_income  median_house_value
0     -114.31     34.19  ...         1.4936             66900.0
1     -114.47     34.40  ...         1.8200             80100.0
3     -114.57     33.64  ...         3.1917             73400.0
10    -114.60     33.62  ...         2.6797             86500.0

[4 rows x 9 columns]

In [0]:
ds[(ds.housing_median_age<20)&(ds.total_rooms>1000)].show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|
|   -114.6|   33.62|              16.0|     3741.0|         801.0|    2434.0|     824.0|       2.6797|           86500.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
only showing top 4 rows

With New Column

In [0]:
#Adding a new Column 
dp['total_rooms_norm'] = dp.total_rooms/sum(dp.total_rooms)
dp.head(2)

   longitude  latitude  ...  median_house_value  total_rooms_norm
0    -114.31     34.19  ...             66900.0          0.000125
1    -114.47     34.40  ...             80100.0          0.000170

[2 rows x 10 columns]

Getting an error with the code below. Seems like a Java issue

In [0]:
# https://docs.databricks.com/spark/latest/dataframes-datasets/introduction-to-dataframes-python.html
# https://towardsdatascience.com/5-ways-to-add-a-new-column-in-a-pyspark-dataframe-4e75c2fd8c08
# Using the F function in pyspark for Aggregation 
from pyspark.sql import functions as F
ds.withColumn('a', ds.total_rooms/ds.groupBy().agg(F.sum("total_rooms")).collect()[0][0]).show()
# https://stackoverflow.com/questions/53583199/pyspark-error-unsupported-class-file-major-version

In [0]:
  #Adding the Current_Date Field to DataFrame 
  from pyspark.sql.functions import current_date
  ds.withColumn('Current_Date', current_date().cast("string")).show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|Current_Date|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------------+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|  2020-05-27|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|  2020-05-27|
|  -114.56|   33.69|              17.0|      720.0|         174.0|     333.0|     117.0|       1.6509|           85700.0|  2020-05-27|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|  2020-05-27|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------------+
only showing top 4 rows

In [0]:
dp['cond'] = dp.apply(lambda c: 1 if ((c.total_rooms>100)&(c.population<400000)) else 2 if c.households> 10 else 3,axis=1)

In [0]:
#Checking the new field added 
dp.head(1)

   longitude  latitude  ...  total_rooms_norm  cond
0    -114.31     34.19  ...          0.000125     1

[1 rows x 11 columns]

In [0]:
# Using When and otherwise in Pyspark 
ds.withColumn('cond',F.when((ds.total_rooms>100)&(ds.population<400000),1)\
                      .when(ds.households>10, 2)\
                      .otherwise(3)).show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+----+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|cond|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+----+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|   1|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|   1|
|  -114.56|   33.69|              17.0|      720.0|         174.0|     333.0|     117.0|       1.6509|           85700.0|   1|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|   1|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+----+
only showing top 4 rows

In [0]:
import numpy as np
dp['log_tv'] = np.log(dp.total_rooms)
dp.head(4)

   longitude  latitude  housing_median_age  ...  total_rooms_norm  cond    log_tv
0    -114.31     34.19                15.0  ...          0.000125     1  8.632662
1    -114.47     34.40                19.0  ...          0.000170     1  8.942461
2    -114.56     33.69                17.0  ...          0.000016     1  6.579251
3    -114.57     33.64                14.0  ...          0.000033     1  7.313887

[4 rows x 12 columns]

In [0]:
#Getting log of total rooms in a new column 
import pyspark.sql.functions as F 
ds.withColumn('log_tv',F.log(ds.total_rooms)).show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|           log_tv|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------------+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|8.632662441222351|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|8.942460926820582|
|  -114.56|   33.69|              17.0|      720.0|         174.0|     333.0|     117.0|       1.6509|           85700.0|6.579251212010101|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|7.313886831633462|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------------+
only showing top 4 rows

In [0]:
#dp['tv+10'] = dp.total_rooms.apply(lambda x: x+10) dp.head(4)
ds.withColumn('tv+10', ds.total_rooms+10).show(4)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value| tv+10|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------+
|  -114.31|   34.19|              15.0|     5612.0|        1283.0|    1015.0|     472.0|       1.4936|           66900.0|5622.0|
|  -114.47|    34.4|              19.0|     7650.0|        1901.0|    1129.0|     463.0|         1.82|           80100.0|7660.0|
|  -114.56|   33.69|              17.0|      720.0|         174.0|     333.0|     117.0|       1.6509|           85700.0| 730.0|
|  -114.57|   33.64|              14.0|     1501.0|         337.0|     515.0|     226.0|       3.1917|           73400.0|1511.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+------+
only showing top 4 rows

# **JOIN**

In [0]:
import pandas as pd 
leftp = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [0]:
rightp = pd.DataFrame({'A': ['A0', 'A1', 'A6', 'A7'],
                       'F': ['B4', 'B5', 'B6', 'B7'],
                       'G': ['C4', 'C5', 'C6', 'C7'],
                       'H': ['D4', 'D5', 'D6', 'D7']},
                       index=[4, 5, 6, 7])

In [0]:
lefts = spark.createDataFrame(leftp)
rights = spark.createDataFrame(rightp)

**Left Join**

In [0]:
leftp.merge(rightp,on='A',how='left')

    A   B   C   D    F    G    H
0  A0  B0  C0  D0   B4   C4   D4
1  A1  B1  C1  D1   B5   C5   D5
2  A2  B2  C2  D2  NaN  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN  NaN

In [0]:
# You could get an error if you have a different version of JAVA on the machine 
#lefts.join(rights,on='A',how='left').orderBy('A',ascending=True).show()

**Right Join**

In [0]:
leftp.merge(rightp,on='A',how='right')

    A    B    C    D   F   G   H
0  A0   B0   C0   D0  B4  C4  D4
1  A1   B1   C1   D1  B5  C5  D5
2  A6  NaN  NaN  NaN  B6  C6  D6
3  A7  NaN  NaN  NaN  B7  C7  D7

In [0]:
# You could get an error if you have a different version of JAVA on the machine 
#lefts.join(rights,on='A',how='right').orderBy('A',ascending=True).show()

**INNER JOIN**

In [0]:
leftp.merge(rightp,on='A',how='inner')

    A   B   C   D   F   G   H
0  A0  B0  C0  D0  B4  C4  D4
1  A1  B1  C1  D1  B5  C5  D5

In [0]:
 lefts.join(rights,on='A',how='inner').orderBy('A',ascending=True).show()

+---+---+---+---+---+---+---+
|  A|  B|  C|  D|  F|  G|  H|
+---+---+---+---+---+---+---+
| A0| B0| C0| D0| B4| C4| D4|
| A1| B1| C1| D1| B5| C5| D5|
+---+---+---+---+---+---+---+

**FULL JOIN**

In [0]:
leftp.merge(rightp,on='A',how='outer')

    A    B    C    D    F    G    H
0  A0   B0   C0   D0   B4   C4   D4
1  A1   B1   C1   D1   B5   C5   D5
2  A2   B2   C2   D2  NaN  NaN  NaN
3  A3   B3   C3   D3  NaN  NaN  NaN
4  A6  NaN  NaN  NaN   B6   C6   D6
5  A7  NaN  NaN  NaN   B7   C7   D7

In [0]:
#lefts.join(rights,on='A',how='full').orderBy('A',ascending=True).show()

# **Concat Columns**

In [0]:
my_list = [('a', 2, 3),
           ('b', 5, 6),
           ('c', 8, 9),
           ('a', 2, 3),
           ('b', 5, 6),
           ('c', 8, 9)]
col_name = ['col1', 'col2', 'col3']
#
dp = pd.DataFrame(my_list,columns=col_name)
ds = spark.createDataFrame(my_list,schema=col_name)

In [0]:
dp['concat'] = dp.apply(lambda x:'%s%s'%(x['col1'],x['col2']),axis=1) 
dp

  col1  col2  col3 concat
0    a     2     3     a2
1    b     5     6     b5
2    c     8     9     c8
3    a     2     3     a2
4    b     5     6     b5
5    c     8     9     c8

In [0]:
from pyspark.sql import functions as F
ds.withColumn('concat',F.concat('col1','col2')).show()

+----+----+----+------+
|col1|col2|col3|concat|
+----+----+----+------+
|   a|   2|   3|    a2|
|   b|   5|   6|    b5|
|   c|   8|   9|    c8|
|   a|   2|   3|    a2|
|   b|   5|   6|    b5|
|   c|   8|   9|    c8|
+----+----+----+------+

# **Group By**

In [0]:
dp.groupby(['col1']).agg({'col2':'min','col3':'mean'})

      col2  col3
col1
a        2     3
b        5     6
c        8     9

In [0]:
ds.groupBy(['col1']).agg({'col2': 'min', 'col3': 'avg'}).show()

+----+---------+---------+
|col1|min(col2)|avg(col3)|
+----+---------+---------+
|   c|        8|      9.0|
|   b|        5|      6.0|
|   a|        2|      3.0|
+----+---------+---------+

# **Pivot**

In [0]:
import numpy as np
pd.pivot_table(dp, values='col3', index='col1', columns='col2', aggfunc=np.sum)

col2    2     5     8
col1
a     6.0   NaN   NaN
b     NaN  12.0   NaN
c     NaN   NaN  18.0

In [0]:
#ds.groupBy(['col1']).pivot('col2').sum('col3').show()

# **Window**

In [0]:
d = {'A':['a','b','c','d'],'B':['m','m','n','n'],'C':[1,2,3,6]}
dp = pd.DataFrame(d)
ds = spark.createDataFrame(dp)

In [0]:
dp['rank'] = dp.groupby('B')['C'].rank('dense',ascending=False) #
from pyspark.sql.window import Window
w = Window.partitionBy('B').orderBy(ds.C.desc())
ds = ds.withColumn('rank',F.rank().over(w))

In [0]:
#ds.show()

# **Rank vs Dense Rank**

In [0]:
d ={'Id':[1,2,3,4,5,6],
    'Score': [4.00, 4.00, 3.85, 3.65, 3.65, 3.50]}
#
data = pd.DataFrame(d)
dp = data.copy()
ds = spark.createDataFrame(data)

In [0]:
dp['Rank_dense'] = dp['Score'].rank(method='dense',ascending =False) 
dp['Rank'] = dp['Score'].rank(method='min',ascending =False)
dp
#
import pyspark.sql.functions as F
from pyspark.sql.window import Window
w = Window.orderBy(ds.Score.desc())
ds = ds.withColumn('Rank_spark_dense',F.dense_rank().over(w)) 
ds = ds.withColumn('Rank_spark',F.rank().over(w))
#ds.show()